posts/new-website.html
<!doctype html>
<html lang="en-us" class=scroll-smooth data-default-appearance=light data-auto-appearance=true>
  <head>
    
    <!-- Clicky -->
    <!-- Clicky -->
    <meta charset="utf-8">
    <title>Luca's blog - Home</title>
    <meta name="description" content="">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="author" content="Luca Cambiaghi" />
    <meta name="description" content="Luca&#39;s blog" />
    <meta name="keywords" content="" />
    <link rel="stylesheet" href="https://lucacambiaghi.com/static/style.css" type="text/css" />
    <link rel="stylesheet" type="text/css" href="https://maxcdn.bootstrapcdn.com/font-awesome/4.6.3/css/font-awesome.min.css">
    
  </head>
  <body class="flex flex-col h-screen px-6 m-auto text-lg leading-7 bg-neutral text-neutral-900 sm:px-14 md:px-24 lg:px-32 dark:bg-neutral-800 dark:text-neutral max-w-7xl">
    

    
    <div id=the-top class="absolute flex self-center">
      <a class="px-3 py-1 text-sm -translate-y-8 rounded-b-lg bg-primary-200 dark:bg-neutral-600 focus:translate-y-0" href=#main-content>
        <span class="font-bold ltr:pr-2 rtl:pl-2 text-primary-600 dark:text-primary-400">&darr;
        </span>Skip to main content
      </a>
    </div>

    <header class="flex justify-between py-6 font-semibold sm:items-center sm:py-10 text-neutral-900 dark:text-neutral print:hidden">
      <div><a class="decoration-primary-500 hover:underline hover:decoration-2 hover:underline-offset-2" href=/>Luca's blog </a></div>
<nav>
  <ul class="flex flex-col list-none sm:flex-row">
    <li class="mb-1 ltr:text-right rtl:text-left sm:mb-0 ltr:sm:mr-7 ltr:sm:last:mr-0 rtl:sm:ml-7 rtl:sm:last:ml-0">
      <a class="decoration-primary-500 hover:underline hover:decoration-2 hover:underline-offset-2" href="https://lucacambiaghi.com/about.html">about</a>
    </li>
    <span class="px-2 text-primary-500">&#183;</span>
    <li class="mb-1 ltr:text-right rtl:text-left sm:mb-0 ltr:sm:mr-7 ltr:sm:last:mr-0 rtl:sm:ml-7 rtl:sm:last:ml-0">
      <a class="decoration-primary-500 hover:underline hover:decoration-2 hover:underline-offset-2" href="https://lucacambiaghi.com/emacsd.html">emacs</a>
    </li>
    <span class="px-2 text-primary-500">&#183;</span>
    <li class="mb-1 ltr:text-right rtl:text-left sm:mb-0 ltr:sm:mr-7 ltr:sm:last:mr-0 rtl:sm:ml-7 rtl:sm:last:ml-0">
      <a class="decoration-primary-500 hover:underline hover:decoration-2 hover:underline-offset-2" href="http://lucacambiaghi.com/nixpkgs/readme.html">nix</a>
    </li>
    <span class="px-2 text-primary-500">&#183;</span>
    <li class="mb-1 ltr:text-right rtl:text-left sm:mb-0 ltr:sm:mr-7 ltr:sm:last:mr-0 rtl:sm:ml-7 rtl:sm:last:ml-0">
      <a class="decoration-primary-500 hover:underline hover:decoration-2 hover:underline-offset-2" href="http://lucacambiaghi.com/nixpkgs/readme.html">
        <i class="fa fa-github" aria-hidden="true"></i>
        <span class="visually-hidden">github</span>
    </a></li>
  </ul>
</nav>
</header>


<main id="main" class="relative grow">
  
<article class="post">
  <h1 class="mt-0 text-4xl font-extrabold text-neutral-900 dark:text-neutral">
    New website!
  </h1>
  <div class="mt-8 mb-8 text-base text-neutral-500 dark:text-neutral-400 print:hidden">
    <div class="flex flex-row flex-wrap items-center">
      <time> May 28, 2020
      </time>
      <span class="px-2 text-primary-500">&#183;</span>
      <span title="tags">(clojurescript shadow-cljs org)
      </span>
    </div>
  </div>
  <section class="flex flex-col max-w-full mt-0 prose lg:flex-row dark:prose-invert">
    <div class="min-w-0 min-h-0 max-w-prose">
      
<div id="outline-container-the-problem" class="outline-2">
<h2 id="the-problem">The problem</h2>
<div class="outline-text-2">
<p>
I have always wanted a personal website. I have attempted several times at creating one.
The first function a personal website should serve is showcase your achievements, e.g. your former experience and projects.
The second function I have always seeked from my website is technical blogging.
Moreover, I wanted my website to be hosted for free, without any limitations.
</p>

<p>
In regards to blogging, I wanted to do it in the simplest way. Not too simple though, as Einstein said:
</p>

<blockquote>
<p>
Everything should be made as simple as possible,
but not any simpler &#x2014;Albert Einstein
</p>
</blockquote>

<p>
In my previous attempts at building a website I never reached that sweet spot: things were either too complex or too simple.
In this blog post I explain what brought me to this point.
</p>
</div>
</div>

<div id="outline-container-previous-approaches" class="outline-2">
<h2 id="previous-approaches">Previous approaches</h2>
<div class="outline-text-2">
<p>
A popular approach is to host a static website on Github Pages with Ruby+Jekyll.
Github recently made this very easy with the <a href="https://github.com/github/personal-website">personal website project</a>.
I tried twice that approach because of how easy and fast it is to set up.
</p>

<p>
The first time I set up a simple website was few years ago and I did it with a minimal Jekyll template to showcase my github projects and my skills.
I had a page where I could easily write blog posts in <code>.md</code> files, placing the posts in a certain folder structure with a certain filename.
Simple enough, right? Maybe too simple. I could not easily control the website template. I had to write my posts in <code>markdown</code> files.
I quickly lost interest in the website and never blogged once.
</p>

<p>
The second time around was at the beginning of 2020, shortly after discovering Emacs.
I saw a beautiful blog online and made it a day's quest to replicate it on my <code>gh-pages</code> branch.
What the author was using was an R library called <code>rmarkdown</code>, which under the hood uses <code>knitr</code> + <code>pandoc</code> to render <code>.Rmd</code> files.
The final touch I added was so I could write posts using my favourite markup language, i.e. Org Mode.
I could write <code>.org</code> files, export them to <code>.Rmd</code> files and finally render them with <code>rmarkdown</code>.
The website's style was stunning also! Very easy to steal some CSS from his website.
</p>

<p>
I could blog writing <code>.org</code> files and I had a beautiful website.. Still I never blogged once. Maybe it was not simple enough.
The setup must have been working very well for its original author, a Data Scientist writing a lot of <code>.Rmd</code> analyses. Not so much for me.
</p>
</div>
</div>

<div id="outline-container-this-approach" class="outline-2">
<h2 id="this-approach">This approach</h2>
<div class="outline-text-2">
<p>
Lately I have been very fascinated by the Clojure programming language. I will write a post in the future about it.
In the websites I am lurking, the community often speaks about Clojurescript which can compile to Javascript code.
Some of the <code>cljs</code> frameworks for simple-page applications seem simple and elegant (like most things Clojure related).
</p>

<p>
Today I found a minimal, beautiful blog set up with <code>shadow-cljs</code>, which had very little code, all of which was understandable enough.
It looks like the author is a <code>js</code> and <code>cljs</code> developer, so it has been interesting to learn some best practices since I have absolutely zero knowledge of frontend development.
</p>

<p>
Well, I forked his repo and it was extremely quick to build the website locally and deploy it to netlify!
New concepts I need to understand more:
</p>
<ul class="org-ul">
<li><code>yarn</code> &gt; <code>npm</code> for managing dependencies, building and releasing</li>
<li><code>tailwind</code> + <code>postcss</code> for easy customization of your website's style</li>
<li><code>yarn shadow-cljs watch app</code> to develop while hot-reloading the website a-la-figwheel</li>
<li>Connecting to the <code>clojurescript</code> REPL to interact with the browser</li>
</ul>

<p>
This is a very exciting environment to develop my website and customize it to my liking! No more deciphering templates and stealing off CSS, I will customize it how I want.
</p>

<p>
The second news, even more exciting, is that the author wrote a simple logic to parse <code>.md</code> and populate the website.
This means that to write my blog posts I can write with Org Mode and easily export to <code>.md</code>.
I will also adopt the approach used in <code>ox-hugo</code>, that is to have a single <code>.org</code> file and have posts live under a heading.
I can then export a single post with <code>,e C-s mm</code>, i.e. calling <code>org-export-dispatch</code>, narrowing the scope to the subtree and exporting to a markdown file.
</p>

<p>
I really like having the full control over the website. Deploying to netlify means that I am not limited to what Github Pages lets me do.
In the future I would like to explore different things, like embedding an interactive <code>D3</code> visualization or a <code>vega-lite</code> SVG.
I am happy to <b>need</b> to understand the details for these integrations instead of resorting to a magical plugin in an obscure template (like with <code>hugo</code>).
</p>
</div>
</div>

<div id="outline-container-why-blogging" class="outline-2">
<h2 id="why-blogging">Why blogging?</h2>
<div class="outline-text-2">
<p>
Technical blogging is a great opportunity to learn how to explain something you <span class="underline">think</span> you know something about and how to organise your thoughts.
Before writing this post I thought I had a clear idea of what to write but at the end of the post I can see that I digressed and I could have benefitted from organizing the structure of the post beforehand.
It's okay since it is my first post, but see? Already learning!
</p>

<p>
In the future I plan to write about the things I deem interesting that I am exploring.
I do this for self documentation and to maybe help a fellow user who might come across the same problem I was solving and maybe it will help him save some time.
I will adjust with time around a certain size and type of content. I expect the two main categories will be data science and software engineering tooling.
</p>
</div>
</div>

    </div>
  </section>
  <section>
    <div id="hyvor-talk-view"></div>
    <hyvor-talk-comments website-id="793" page-id="new-website"></hyvor-talk-comments>
  </section>

  <!-- <div class="absolute top-[110vh] ltr:right-0 rtl:left-0 w-12 pointer-events-none bottom-[-5.5rem]"> -->
  <!--   <a href="#the-top" class="w-12 h-12 sticky pointer-events-auto top-[calc(100vh-5rem)] bg-neutral/50 dark:bg-neutral-800/50 backdrop-blur rounded-full text-xl flex items-center justify-center text-neutral-700 dark:text-neutral hover:text-primary-600 dark:hover:text-primary-400" aria-label="Scroll to top" title="Scroll to top">↑</a> -->
  <!-- </div> -->

</article>

</main>



<footer class="py-10 print:hidden">
  <div class="flex justify-between">
    <div>
      <p class="text-sm text-neutral-500 dark:text-neutral-400">&copy;
        Luca Cambiaghi
      </p>
      <p class="text-xs text-neutral-500 dark:text-neutral-400">Theme inspired by
        <a class="hover:underline hover:decoration-primary-400 hover:text-primary-500" "href=https://git.io/hugo-congo" target=_blank rel="noopener noreferrer">Congo
        </a>
      </p>
    </div>
    <div class="text-sm cursor-pointer text-neutral-700 dark:text-neutral hover:text-primary-600 dark:hover:text-primary-400 ltr:mr-14 rtl:ml-14">
      <button id=appearance-switcher class="w-12 h-12" type=button title="Switch to dark appearance">
        <span class="inline dark:hidden"><span class="relative inline-block align-text-bottom icon"><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path fill="currentcolor" d="M32 256C32 132.2 132.3 32 255.8 32c11.36.0 29.7 1.668 40.9 3.746 9.616 1.777 11.75 14.63 3.279 19.44C245 86.5 211.2 144.6 211.2 207.8c0 109.7 99.71 193 208.3 172.3 9.561-1.805 16.28 9.324 10.11 16.95C387.9 448.6 324.8 480 255.8 480 132.1 480 32 379.6 32 256z"/></svg></span></span><span class="hidden dark:inline"><span class="relative inline-block align-text-bottom icon"><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path fill="currentcolor" d="M256 159.1c-53.02.0-95.1 42.98-95.1 95.1s41.2 96.9 95.1 96.9 95.1-42.98 95.1-95.1S309 159.1 256 159.1zM509.3 347l-63.2-91.9 63.15-91.01c6.332-9.125 1.104-21.74-9.826-23.72l-109-19.7-19.7-109c-1.975-10.93-14.59-16.16-23.72-9.824L256 65.89 164.1 2.736c-9.125-6.332-21.74-1.107-23.72 9.824L121.6 121.6 12.56 141.3C1.633 143.2-3.596 155.9 2.736 164.1L65.89 256 2.74 347.01c-6.332 9.125-1.105 21.74 9.824 23.72l109 19.7 19.7 109c1.975 10.93 14.59 16.16 23.72 9.824L256 446.1l91.01 63.15c9.127 6.334 21.75 1.107 23.72-9.822l19.7-109 109-19.7C510.4 368.8 515.6 356.1 509.3 347zM256 383.1c-70.69.0-127.1-57.31-127.1-127.1.0-70.69 57.31-127.1 127.1-127.1S383.1 186.2 383.1 256c0 70.7-56.4 127.1-127.1 127.1z"/></svg></span></span></button></div></div></footer>


</body>
</html>
